import { motion as m } from 'framer-motion';

const Return = () => {
  return (
    <m.div initial={{ opacity: 0 }} animate={{ opacity: 1 }} transition={{ duration: 0.3 }}>
      <div className="flex flex-col gap-6">
        <p className="text-25px font-semibold">Повернення та обмін</p>
        <p className="text-18px font-semibold">
          Ми розуміємо, що іноді може виникнути потреба в обміні або поверненні товару, і ми готові
          надати вам чітку інформацію щодо наших правил та процедур у цьому питанні.
        </p>
        <ol className="text-16px font-normal">
          <li className="pl-4">
            Право на обмін і повернення: Ви маєте право на обмін або повернення товару протягом 14
            днів з моменту отримання замовлення. Обмін або повернення можливе лише у випадку, якщо
            товар не був використаний, не має слідів пошкодження та зберігає всі заводські
            пакувальні матеріали та ярлики.
          </li>
          <br />
          <li className="pl-4">
            Процедура обміну і повернення: Зверніться до нашої служби підтримки клієнтів в
            Телеграм-боті або на електронну пошту info@worldisyours.com , щоб повідомити нас про
            ваші наміри обміну або повернення товару. Вкажіть номер вашого замовлення та причину
            обміну або повернення. Ми надамо вам інструкції щодо подальших дій. Будь ласка, не
            відправляйте товар назад до нас без попередньої згоди та інструкцій.
          </li>
          <br />
          <li className="pl-4">
            Вартість обміну і повернення: Ви будете відповідальні за вартість доставки товару назад
            до нас в разі повернення товару зі свого боку. В разі обміну, ми покрити вартість
            доставки нового товару до вас.
          </li>
          <br />
          <li className="pl-4">
            Перевірка стану товару: При отриманні товару, ми перевіримо його стан для визначення
            відповідності вказаним вище правилам. Якщо товар не відповідає цим вимогам, ми можемо
            відмовити в обміні або поверненні.
          </li>
          <br />
          <li className="pl-4">
            Терміни обробки: Ми намагаємося обробляти запити на обмін або повернення якнайшвидше,
            зазвичай це займає 1 день. Протягом цього часу ми зв&#39;яжемося з вами, щоб повідомити
            про статус вашого запиту
          </li>
        </ol>
        <p className="text-16px font-normal">
          Будь ласка, звертайтеся до нашої служби підтримки клієнтів для отримання подробиць та
          допомоги у вирішенні будь-яких питань, пов&#39;язаних з обміном або поверненням товару. Ми
          завжди готові забезпечити вас якісним обслуговуванням і робимо все можливе, щоб зробити
          ваше перебування в нашому автодомі приємним та комфортним
        </p>
      </div>
    </m.div>
  );
};

export default Return;
